{
    "plant": [
              {
              "commonName": "sweet pea",
              "img1": "sweet pea.jpg",
              "scientificName": "Lathyrus",
              "generalDescription": "Herbaceous plant, climbing, sometimes suffruticosa. The height can vary from 20-30cm to 3m, has pinnate leaves, flowers with the pipalilla corolla, is easy to grow and available.",
              "climate": "Temperate",
              "category": "Herbaceous",
              "dedication": "Often",
              "exposure": "Full sun",
              "environment": "Outdoor",
              "size": "Small",
              "fertilization": "Add complex fertilizer every 15 days together with the infestation",
              "irrigation": "Watering must be regular in the spring and summer months, while it must be gradually reduced with the advent of winter.",
              "pruning": "Prune any damage to the plant and the faded inflorescences",
              "pruningDate": "",
              "repotting": "No information about repotting",
              "repottingDate": "",
              "propagation": "It can take place in September-October with the sowing, for the perennial species it is also possible to divide the tufts",
              "illnesses": "Possible fungal and virus infection, easily eliminated with specific products",
              "flowering": "Occurs in the spring-summer period, the flowers can be of various colors, from purple, pink to red and white with various shades.",
              "origins": "Europe, Asia"
              },
              {
              "commonName": "azalea",
              "img1": "azalea.jpg",
              "scientificName": "Rhododendron",
              "generalDescription": "Shrubs with small, dark green, oval, hairy and leathery leaves. They can be deciduous or evergreen. The flowers are simple, gathered in bunches, of colors ranging from white, to red, to pink, to purple and have a chalice made of 5 sepals and a corolla with 5 petals, which in the double forms can be numerous; they are found in the axil of the leaves or gathered in corymbus inflorescences. The fruit is a brown capsule that contains many very small seeds",
              "climate": "Temperate",
              "category": "Shrubby",
              "dedication": "Often",
              "exposure": "Full sun",
              "environment": "Outdoor",
              "size": "Medium",
              "fertilization": "The azalea does not have high nutritional requirements, however it is good to administer liquid fertilizers with the water of watering every 15 days approximately.",
              "irrigation": "You should water frequently with non-calcareous water (possibly rainfall) in order to keep the substratum always moist.",
              "pruning": "Pruning is usually done at the end of flowering, at the end of spring or early summer. Pruning is necessary to keep the plant in regular shape, and it is necessary to remove the faded flowers",
              "pruningDate": "",
              "repotting": "Indicatively every 3 years with acid soil at the end of winter",
              "repottingDate": "",
              "propagation": "The most common method of propagation is by cuttings. In the period from July to September we pick up herbaceous or semi-woody buds about 10 cm long. Cuttings are often nebulized and kept at a temperature of around 20°C. After about a month they will have developed a very thin and fragile root system, for which they will be gently potted in 8 cm diameter pots containing a peat substrate, pine needles and heath land.",
              "illnesses": "The diseases that most often affect azaleas in the apartment are mainly physiopaths. If the leaves and flowers turn out to be faded and withered they denote a lack of water, so it is necessary to completely immerse the vase in water until no more air bubbles are formed and then it is allowed to drain.",
              "flowering": "Depending on the species in spring or summer",
              "origins": "East Asia, and in particular Japan, Nepal, China, North Korea, Vietnam; North America and in particular Florida and from Northern Europe"
              },
              {
              "commonName": "petunia",
              "img1": "petunia.jpg",
              "scientificName": "Petunia",
              "generalDescription": "The genus includes 40 species of weedy plants that develop large bushes, densely branched, 25-60 cm tall, and which often have prostrate or falling stems; the leaves, light green in color, are covered with a very thin down, to the touch they are slightly sticky, and give off a characteristic scent. The flowers, with a tubular corolla, are solitary and supported by terminal or axillary peduncles. They present the full range of colors, from white to pink, from purple to blue.",
              "climate": "Temperate",
              "category": "Herbaceous",
              "dedication": "Often",
              "exposure": "Full sun",
              "environment": "Outdoor",
              "size": "Medium",
              "fertilization": "When repotting, mix a small quantity of mature organic fertilizer or humus with the soil; thereafter, from May to September, fertilizer for flowering plants is provided, every 15-20 days, mixed with the water of watering",
              "irrigation": "They are quite demanding as regards watering; they can withstand a few hours of drought, but the plants tend to dry quickly in case of prolonged water shortage; then water regularly every 2-3 days.",
              "pruning": "It is sufficient to eliminate the flowers at the end of flowering",
              "pruningDate": "",
              "repotting": "Depending on the growth it may also be necessary every year",
              "repottingDate": "",
              "propagation": "Sowing takes place in February-March in a warm bed. The new seedlings are kept in a closed and humid environment until they reach at least 10 cm. They are then placed on organic soil by removing the flowers and the leaves withered",
              "illnesses": "The biggest parasite is the red spider mite: the leaves become gray - yellowish, sometimes rusty. They are also attacked by aphids",
              "flowering": "Very abundant, it lasts from mid-spring to mid-autumn",
              "origins": "Mostly originating in South America, especially in Brazil"
              },
              {
              "commonName": "rose",
              "img1": "rose.jpg",
              "scientificName": "Rosa",
              "generalDescription": "Deciduous shrub with variable behavior according to species. The hybrid rose has an upright posture, the stem is lignified and presents thorns, the bark is smooth, green or reddish at an early age to become greyish in the older specimens. The leaves are arranged alternately on the stem and are of the compound type, imparipennate. The leaflets are oval-lanceolate and have a notched margin. At the base of the petiole there are some stipulations often partially welded with this.",
              "climate": "Temperate",
              "category": "Shrubby",
              "dedication": "Often",
              "exposure": "Full sun",
              "environment": "Outdoor",
              "size": "Medium",
              "fertilization": "Fertilize during the vegetative period",
              "irrigation": "They must be abundantly watered in the spring and summer, because the drought compromises the flowering and determines the fall of the foliage. Decrease in the winter period",
              "pruning": "Eliminate dry, damaged branches and withered flowers",
              "pruningDate": "",
              "repotting": "Whenever the roots have completely filled the vase in spring",
              "repottingDate": "",
              "propagation": "Through semi-woody cuttings that in August-September they start to root in a shady but luminous place, after having firmly stuck them in a soil rich in humus that should never be left completely dry, but should always be kept slightly damp. The rose also reproduces by seed",
              "illnesses": "They are prone to pest infestations (aphids, cochineals in particular) and fungal diseases (white mal or rust, which, as their names suggest, consist of a white powder or rust-colored spots that disfigure the leaves and weaken the plants) for which the bushes must be controlled and intervene when appropriate with appropriate treatment.",
              "flowering": "It takes place between May and June, some species also in September",
              "origins": "Emisfero boreale. Europa, Asia e America Settentrionale"
              },
              {
              "commonName": "tree mallow",
              "img1": "tree mallow.jpg",
              "scientificName": "Malva",
              "generalDescription": "The height varies from 30 cm to 1 m., It has an erect stem or is a long and robust hat, covered with fluff, has a long stem a taproot with secondary branches. It has green leaves, scarce, long petiolate, palminervie; the flowers are pink with purple streaks, large, pedunculated, and are a small calyx composed of three small bracts, and a corolla with 5 petals. The carpels, each containing an egg, are arranged vertically. the way to make the biconcave disco. Cultivation is very easy",
              "climate": "Temperate",
              "category": "Erected",
              "dedication": "Rarely",
              "exposure": "Dim light",
              "environment": "Indoor",
              "size": "Medium",
              "fertilization": "It must not be fertilized",
              "irrigation": "Watering is poor, the plants resist well to low humidity, if periodic prolonged drought occur it is advisable to intervene with some watering.",
              "pruning": "The damaged parts and the withered flowers have to be eliminated",
              "pruningDate": "",
              "repotting": "No information about repotting",
              "repottingDate": "",
              "propagation": "It is carried out in spring through sowing. When the seedlings can be handled, they can be repotted",
              "illnesses": "Possible occurrences of fungi and virosis (curling of the plant) can be eliminated with appropriate products",
              "flowering": "It takes place in summer and in autumn",
              "origins": "Europe"
              },
              {
              "commonName": "morning glory",
              "img1": "morning glory.jpg",
              "scientificName": "Ipomoea",
              "generalDescription": "A herbaceous plant, a second of the species can be annual or perennial, climbing, or shrub. It is usually cultivated before October. Easy to grow and find. About 500 species with flowers with a typical funnel shape are known. Difficult colors from violet, violet, white, yellow and crimson; sometimes they are fringed, streaked or fluted. Vulgarly it is called \"bell\" because of the typical shape of its inflorescences.",
              "climate": "Tropical",
              "category": "Herbaceous",
              "dedication": "Often",
              "exposure": "Full sun",
              "environment": "Outdoor",
              "size": "Medium",
              "fertilization": "Use complete fertilizers according to the manufacturer's instructions",
              "irrigation": "Keep the soil constantly moist during the hot season, avoiding stagnant water. With decreasing temperatures, gradually decrease",
              "pruning": "It is sufficient to eliminate the faded or damaged parts",
              "pruningDate": "",
              "repotting": "When necessary, in spring",
              "repottingDate": "",
              "propagation": "Depending on the species through senilegnosa cuttings, offshoots or sowing in spring",
              "illnesses": "No particular diseases or parasites are reported. It can be affected by phytophages: aphids, thrips and red spider that infest young seedlings, causing decay and yellowing of leaves. Aphids can also be defended based on treatments based on natural pyrethrum.",
              "flowering": "Depending on the species, it starts to bloom around May-June, it blooms throughout the summer",
              "origins": "Central America, Asia"
              },
              {
              "commonName": "sunflower",
              "img1": "sunflower.jpg",
              "scientificName": "Helianthus annuus",
              "generalDescription": "Flowering plant, it can be annual or perennial according to the species. Cultivable outdoors or in pot without particular difficulties. The species Helianthus annuus or Girasole is the most widespread, has an erect stem and can reach 3 meters in height; only rarely is it branched into the upper part. The leaves are pedunculated, roped and irregularly serrated. The flowers are large flower heads (calatids) reclined with brown central disc and yellow ligule. The fruits follow the flowering.",
              "climate": "Wet temperate",
              "category": "Erected",
              "dedication": "Often",
              "exposure": "Full sun",
              "environment": "Outdoor",
              "size": "Medium",
              "fertilization": "The need for special fertilizers is not to be reported",
              "irrigation": "Do not go wet often, allow the soil to dry slightly between one watering and another. Absolutely avoid water stagnation. They can also endure a short period of drought.",
              "pruning": "Eliminate damaged parts and withered flowers",
              "pruningDate": "",
              "repotting": "It depends on the type of species cultivated",
              "repottingDate": "",
              "propagation": "By subdivision of the tufts at the end of spring or for sowing in April. Sow directly to a dwelling in a substrate that guarantees excellent drainage.",
              "illnesses": "It is important to protect the plant from the slime using products based on metaldehyde. The most common fungal diseases are gray mold and the rind to be treated with specific fungicidal products.",
              "flowering": "Only summer flowering, from August to October.",
              "origins": "North America, especially in the southern regions."
              }
              ]
              ,
    "list": [{
             "listName": "Garden",
             },
             {
             "listName": "Wishlist",
             }
             ]
}

