{
    "plant": [
              {
              "commonName": "sweet pea",
              "img1": "sweet pea.jpg",
              "scientificName": "Lathyrus",
              "generalDescription": "Herbaceous plant, climbing, sometimes suffruticosa. The height can vary from 20-30cm to 3m, has pinnate leaves, flowers with the pipalilla corolla, is easy to grow and available. Sweet Pea is a very popular and familiar hardy annual flowering plant. It is appreciated for it's delicate blooms and fragrant scents. When trained up a wall or trellis it can reach a height of three metres. Without support it can be grown in a mixed annual border - particularly dwarf varieties. With regular deadheading the flush of flowers, that begins in early summer, will continue right into the autumn. Lathyrus flowers come in a very wide array of colours including white, pinks, reds, mauves, blues,and purples. Most sweet pea blooms are pleasantly scented.",
              "climate": "Temperate",
              "category": "Herbaceous",
              "dedication": "Often",
              "exposure": "Full sun",
              "environment": "Outdoor",
              "size": "Small",
              "fertilization": "Add complex fertilizer every 15 days together with the infestation",
              "irrigation": "Watering must be regular in the spring and summer months, while it must be gradually reduced with the advent of winter.",
              "pruning": "Prune any damage to the plant and the faded inflorescences",
              "pruningDate": "",
              "repotting": "No information about repotting",
              "repottingDate": "",
              "propagation": "It can take place in September-October with the sowing, for the perennial species it is also possible to divide the tufts",
              "illnesses": "The sweet pea plant does suffer from some pests, the most common being aphids. These insects suck the sap out of the plants, reducing growth. A pest called the pollen beetle which is small, shiny and black, eats the pollen and disfigures the flowers. Another problem is mildew; this is a white powdery coating that covers the leaves and slows down growth.The sweet pea is also susceptible to ethylene in quantities produced by senescing plants. Because of this, growers are encouraged to plant sweet peas away from fruit trees among other plants prone to early dieback or senescence.",
              "flowering": "Occurs in the spring-summer period, the flowers can be of various colors, from purple, pink to red and white with various shades.",
              "origins": "Europe, Asia"
              },
              {
              "commonName": "azalea",
              "img1": "azalea.jpg",
              "scientificName": "Rhododendron",
              "generalDescription": "Shrubs with small, dark green, oval, hairy and leathery leaves. They can be deciduous or evergreen. The flowers are simple, gathered in bunches, of colors ranging from white, to red, to pink, to purple and have a chalice made of 5 sepals and a corolla with 5 petals, which in the double forms can be numerous; they are found in the axil of the leaves or gathered in corymbus inflorescences. The fruit is a brown capsule that contains many very small seeds",
              "climate": "Temperate",
              "category": "Shrubby",
              "dedication": "Often",
              "exposure": "Full sun",
              "environment": "Outdoor",
              "size": "Medium",
              "fertilization": "The azalea does not have high nutritional requirements, however it is good to administer liquid fertilizers with the water of watering every 15 days approximately.",
              "irrigation": "You should water frequently with non-calcareous water (possibly rainfall) in order to keep the substratum always moist.",
              "pruning": "Pruning is usually done at the end of flowering, at the end of spring or early summer. Pruning is necessary to keep the plant in regular shape, and it is necessary to remove the faded flowers",
              "pruningDate": "",
              "repotting": "Indicatively every 3 years with acid soil at the end of winter",
              "repottingDate": "",
              "propagation": "The most common method of propagation is by cuttings. In the period from July to September we pick up herbaceous or semi-woody buds about 10 cm long. Cuttings are often nebulized and kept at a temperature of around 20°C. After about a month they will have developed a very thin and fragile root system, for which they will be gently potted in 8 cm diameter pots containing a peat substrate, pine needles and heath land.",
              "illnesses": "The diseases that most often affect azaleas in the apartment are mainly physiopaths. If the leaves and flowers turn out to be faded and withered they denote a lack of water, so it is necessary to completely immerse the vase in water until no more air bubbles are formed and then it is allowed to drain.",
              "flowering": "Depending on the species in spring or summer",
              "origins": "East Asia, and in particular Japan, Nepal, China, North Korea, Vietnam; North America and in particular Florida and from Northern Europe"
              },
              {
              "commonName": "petunia",
              "img1": "petunia.jpg",
              "scientificName": "Petunia",
              "generalDescription": "The genus includes 40 species of weedy plants that develop large bushes, densely branched, 25-60 cm tall, and which often have prostrate or falling stems; the leaves, light green in color, are covered with a very thin down, to the touch they are slightly sticky, and give off a characteristic scent. The flowers, with a tubular corolla, are solitary and supported by terminal or axillary peduncles. They present the full range of colors, from white to pink, from purple to blue.",
              "climate": "Temperate",
              "category": "Herbaceous",
              "dedication": "Often",
              "exposure": "Full sun",
              "environment": "Outdoor",
              "size": "Medium",
              "fertilization": "When repotting, mix a small quantity of mature organic fertilizer or humus with the soil; thereafter, from May to September, fertilizer for flowering plants is provided, every 15-20 days, mixed with the water of watering",
              "irrigation": "They are quite demanding as regards watering; they can withstand a few hours of drought, but the plants tend to dry quickly in case of prolonged water shortage; then water regularly every 2-3 days.",
              "pruning": "It is sufficient to eliminate the flowers at the end of flowering",
              "pruningDate": "",
              "repotting": "Depending on the growth it may also be necessary every year",
              "repottingDate": "",
              "propagation": "Sowing takes place in February-March in a warm bed. The new seedlings are kept in a closed and humid environment until they reach at least 10 cm. They are then placed on organic soil by removing the flowers and the leaves withered",
              "illnesses": "The biggest parasite is the red spider mite: the leaves become gray - yellowish, sometimes rusty. They are also attacked by aphids",
              "flowering": "Very abundant, it lasts from mid-spring to mid-autumn",
              "origins": "Mostly originating in South America, especially in Brazil"
              },
              {
              "commonName": "rose",
              "img1": "rose.jpg",
              "scientificName": "Rosa",
              "generalDescription": "Deciduous shrub with variable behavior according to species. The hybrid rose has an upright posture, the stem is lignified and presents thorns, the bark is smooth, green or reddish at an early age to become greyish in the older specimens. The leaves are arranged alternately on the stem and are of the compound type, imparipennate. The leaflets are oval-lanceolate and have a notched margin. At the base of the petiole there are some stipulations often partially welded with this.",
              "climate": "Temperate",
              "category": "Shrubby",
              "dedication": "Often",
              "exposure": "Full sun",
              "environment": "Outdoor",
              "size": "Medium",
              "fertilization": "Fertilize during the vegetative period",
              "irrigation": "They must be abundantly watered in the spring and summer, because the drought compromises the flowering and determines the fall of the foliage. Decrease in the winter period",
              "pruning": "Eliminate dry, damaged branches and withered flowers",
              "pruningDate": "",
              "repotting": "Whenever the roots have completely filled the vase in spring",
              "repottingDate": "",
              "propagation": "Through semi-woody cuttings that in August-September they start to root in a shady but luminous place, after having firmly stuck them in a soil rich in humus that should never be left completely dry, but should always be kept slightly damp. The rose also reproduces by seed",
              "illnesses": "They are prone to pest infestations (aphids, cochineals in particular) and fungal diseases (white mal or rust, which, as their names suggest, consist of a white powder or rust-colored spots that disfigure the leaves and weaken the plants) for which the bushes must be controlled and intervene when appropriate with appropriate treatment.",
              "flowering": "It takes place between May and June, some species also in September",
              "origins": "Emisfero boreale. Europa, Asia e America Settentrionale"
              },
              {
              "commonName": "tree mallow",
              "img1": "malva.jpg",
              "scientificName": "Malva",
              "generalDescription": "A member of the large mallow family, Lavatera produces bright flowers that resemble those of its relatives, hibiscus and hollyhock. The island mallow (L. assurgentiflora, also called Malva assurgentiflora), is native to California, where the plant is easily naturalized in coastal gardens. Other species of Lavatera such as L. maritima, L. trimestris and L. thuringiaca grow best in a Mediterranean-type or coastal climate that features mild winters and long, hot summers. Lavatera is a short-lived plant and is considered pest- and disease-free because it rarely suffers from insect or disease damage. That does not mean the plant never has problems, but it can usually resist them.",
              "climate": "Temperate",
              "category": "Erected",
              "dedication": "Rarely",
              "exposure": "Dim light",
              "environment": "Indoor",
              "size": "Medium",
              "fertilization": "It must not be fertilized",
              "irrigation": "Watering is poor, the plants resist well to low humidity, if periodic prolonged drought occur it is advisable to intervene with some watering.",
              "pruning": "The damaged parts and the withered flowers have to be eliminated",
              "pruningDate": "",
              "repotting": "No information about repotting",
              "repottingDate": "",
              "propagation": "It is carried out in spring through sowing. When the seedlings can be handled, they can be repotted",
              "illnesses": "To prevent hollyhock rust and other pathogens from infecting the Lavatera, keep the area around the plant free of plant debris and weeds. High levels of nitrogen in fertilizer can cause aphids to reproduce more rapidly. Use a fungicide in early spring as a preventive against infections carried into the garden by insects and wildlife. ",
              "flowering": "It takes place in summer and in autumn",
              "origins": "Europe"
              },
              {
              "commonName": "morning glory",
              "img1": "ipomomea.jpg",
              "scientificName": "Ipomoea",
              "generalDescription": "A herbaceous plant, a second of the species can be annual or perennial, climbing, or shrub. It is usually cultivated before October. Easy to grow and find. About 500 species with flowers with a typical funnel shape are known. Difficult colors from violet, violet, white, yellow and crimson; sometimes they are fringed, streaked or fluted. Vulgarly it is called \"bell\" because of the typical shape of its inflorescences.",
              "climate": "Tropical",
              "category": "Herbaceous",
              "dedication": "Often",
              "exposure": "Full sun",
              "environment": "Outdoor",
              "size": "Medium",
              "fertilization": "Use complete fertilizers according to the manufacturer's instructions",
              "irrigation": "Keep the soil constantly moist during the hot season, avoiding stagnant water. With decreasing temperatures, gradually decrease",
              "pruning": "It is sufficient to eliminate the faded or damaged parts",
              "pruningDate": "",
              "repotting": "When necessary, in spring",
              "repottingDate": "",
              "propagation": "Depending on the species through senilegnosa cuttings, offshoots or sowing in spring",
              "illnesses": "No particular diseases or parasites are reported. It can be affected by phytophages: aphids, thrips and red spider that infest young seedlings, causing decay and yellowing of leaves. Aphids can also be defended based on treatments based on natural pyrethrum.",
              "flowering": "Depending on the species, it starts to bloom around May-June, it blooms throughout the summer",
              "origins": "Central America, Asia"
              },
              {
              "commonName": "sunflower",
              "img1": "sunflower.jpg",
              "scientificName": "Helianthus annuus",
              "generalDescription": "Flowering plant, it can be annual or perennial according to the species. Cultivable outdoors or in pot without particular difficulties. The species Helianthus annuus or Girasole is the most widespread, has an erect stem and can reach 3 meters in height; only rarely is it branched into the upper part. The leaves are pedunculated, roped and irregularly serrated. The flowers are large flower heads (calatids) reclined with brown central disc and yellow ligule. The fruits follow the flowering.",
              "climate": "Wet temperate",
              "category": "Erected",
              "dedication": "Often",
              "exposure": "Full sun",
              "environment": "Outdoor",
              "size": "Medium",
              "fertilization": "The need for special fertilizers is not to be reported",
              "irrigation": "Do not go wet often, allow the soil to dry slightly between one watering and another. Absolutely avoid water stagnation. They can also endure a short period of drought.",
              "pruning": "Eliminate damaged parts and withered flowers",
              "pruningDate": "",
              "repotting": "It depends on the type of species cultivated",
              "repottingDate": "",
              "propagation": "By subdivision of the tufts at the end of spring or for sowing in April. Sow directly to a dwelling in a substrate that guarantees excellent drainage.",
              "illnesses": "It is important to protect the plant from the slime using products based on metaldehyde. The most common fungal diseases are gray mold and the rind to be treated with specific fungicidal products.",
              "flowering": "Only summer flowering, from August to October.",
              "origins": "North America, especially in the southern regions."
              },
               {
               "commonName": "lotus flower",
               "img1": "lotus flower.jpg",
               "scientificName": "Nelumbo",
               "generalDescription": "Aquatic plant with pelted leaves, with the petiole positioned in the center of the round green lamina, rippled and covered with a waxy malt. The flowers come out of the water and are very ornamental. They are presented with oval buds and then hatch and become very large. The species Nelumbium nucifera possesses stems of flowers longer than 1 m. with pink-purple flowers; the species N. lutea is rarer and has large yellow fragrant flowers.",
               "climate": "Wet temperate",
               "category": "Aquatic",
               "dedication": "Rarely",
               "exposure": "Dim light",
               "environment": "Outdoor",
               "size": "Small",
               "fertilization": "No information about fertilization",
               "irrigation": "No information about irrigation",
               "pruning": "When pruning or trimming, never cut flower or leaf stems below the water level, as roots and tubers use stems (even dead ones) to help provide oxygen. When lowering lotus for winter, prune after lowering.",
               "pruningDate": "",
               "repotting": "When lotus just begin to show leaf spikes in the spring, their tubers may be carefully divided for making new pots. This may also be necessary every few years for older pots that are overcrowded and have exhausted their soil. The growing points on lotus tubers are very fragile and easily snap off. While there are usually a couple of growing points on each tuber, if you break them all off the tuber will not sprout, no matter how big or fat it is.",
               "repottingDate": "",
               "propagation": "It is carried out by division of the rhizomes which are planted in spring in a soil rich in organic substance. The water is then gradually added to the development of the plant.",
               "illnesses": "Possible aphids and fungi to fight with special medicines",
               "flowering": "It blooms in the summer period",
               "origins": "Asia, America"
               },
               {
               "commonName": "watercress",
               "img1": "watercress.jpg",
               "scientificName": "Nasturtium officinalis",
               "generalDescription": "It is an aquatic plant, has imparipennate and evergreen leaves, with a rounded shape that have an intense green color and a fleshy consistency; this plant can reach a height of 70 cm",
               "climate": "Temperate",
               "category": "Aquatic",
               "dedication": "Often",
               "exposure": "Full sun",
               "environment": "Outdoor",
               "size": "Medium",
               "fertilization": "Watercress does not have a high nutrient requirement. However, cultivated watercress may show phosphorus, potassium or iron deficiencies. Phosphate deficient plants are stunted and dark colored. Symptoms of potassium deficiency are marginal scorching on older leaves. Iron deficient leaves, common in the winter, are expressed as yellowing between the veins on the newer foliage. Mixing a complete soluble fertilizer with the water at the recommended rates minimizes these problems.",
               "irrigation": "No information about irrigation",
               "pruning": "No information about pruning",
               "pruningDate": "",
               "repotting": "No information about repotting",
               "repottingDate": "",
               "propagation": "It can easily be cultivated in the vegetable garden by picking small clusters of spontaneous young plants. They are transplanted into organic soil always kept moist. It can also be sown in peat pots and then transplanted.",
               "illnesses": "Watercress has no specific disease problems in most production settings. However, white flies, spider mites or snails are some of the more common insect problems. White flies are found underneath the leaves and can be controlled with soapy water or insecticidal soap.Injury can lead to leaf loss and plant death. Natural enemies of these pests include small lady beetles, predatory mites and predatory thrips. Snails can be removed by hand, controlled with a molluscide, or trapped. Always follow labeled directions when using any herbicide, pesticide or fungicide.",
               "flowering": "It blooms in spring / summer with white flowers gathered in clusters",
               "origins": "No information"
               },
               {
               "commonName": "afelandra",
               "img1": "afelandra.jpg",
               "scientificName": "Aphelandra squarrosa",
               "generalDescription": "Evergreen shrub that in nature reaches 2-3 m in height and in a container is kept close to 50-60 cm. The fleshy stems, dark, bear numerous oval leaves, very large, light green with white or yellow veins, very showy, shiny and slightly wrinkled. In spring it produces short spikes covered with tubular flowers, under each of which there is a colored bract, generally yellow, but there are varieties with bracts and orange, pink or red flowers. These plants have a fairly compact, very branched and dense habit.",
               "climate": "Tropical",
               "category": "Shrubby",
               "dedication": "Often",
               "exposure": "Average light",
               "environment": "Indoor",
               "size": "Medium",
               "fertilization": "From March to October provide fertilizer for flowering plants, mixed with water for watering, every 10-15 days",
               "irrigation": "Water regularly, letting the soil dry between one watering and another, without ever soaking the soil too much; excessive watering can promote root rot, and cause the yellowing of the leaves. In general these plants do not tolerate drought well, and in cases of prolonged periods without water they tend to sag; in both cases the plant tends to lose its leaves. In winter, water sporadically. Always use water at room temperature and possibly lime free.",
               "pruning": "If the plant is conserved in winter, it is advisable to make a pruning of about half the length of the emitted branches. It is practiced at the end of summer. In general, remove the damaged parts and clean the leaves with a moist cloth.",
               "pruningDate": "",
               "repotting": "If the plant is conserved in winter, it is advisable to make a pruning of about half the length of the emitted branches. It is practiced at the end of summer. In general, remove the damaged parts and clean the leaves with a moist cloth.",
               "repottingDate": "",
               "propagation": "By sowing in spring or by cuttings that root quickly and easily",
               "illnesses": "They particularly fear root rot, aphids and cochineal. White spots under the leaves indicate the presence of cochineals; the deformed leaves are a symptom of the presence of lice or aphids; finally, if the leaves fall it means that the room's climate is too dry.",
               "flowering": "Summer",
               "origins": "South Central America"
               },
               {
               "commonName": "begonia coccinea",
               "img1": "begonia coccinea.jpg",
               "scientificName": "Begonia coccinea",
               "generalDescription": "Shrub plant with flowers gathered in cobs and coral red. The height reaches 2 meters and the leaf crown 1 meter in diameter. The leaves are green with red margins",
               "climate": "Temperate",
               "category": "Shrubby",
               "dedication": "Assiduously",
               "exposure": "Filtered light",
               "environment": "Indoor",
               "size": "Medium",
               "fertilization": "It should be fertilized all year round, in spring and summer at fortnight intervals, using ternary liquid fertilizers with NPK diluted in water. In winter, limit or suspend the interventions. Begonia can show symptoms of nutrient deficiency. Nitrogen: leaf yellowing and subsequent reddening of the basal leaves; Phosphorus: slow growth; Potassium: browning of the margins of the basal leaves; Magnesium, much in demand from begonia, shows symptoms of deficiency with yellowing (or chlorosis) of the leaf areas between the ribs (internally chloral). Boron: leaf curls",
               "irrigation": "Quite frequent, but not excessive. Between one watering and the other the root surface must have time to dry out. More frequent in the summer, to be reduced to a minimum during the winter. In summer it is important to vaporize the leaves",
               "pruning": "The faded and dried branches must be cut in March, before repotting. In summer, topping several times because the plant does not thin",
               "pruningDate": "",
               "repotting": "It is necessary with the growth of the plant to transfer it into larger pots in the periods from March to July",
               "repottingDate": "",
               "propagation": "Via leaf cuttings in spring",
               "illnesses": "No particular diseases or parasites are reported. If the earth is too dry or too wet it is possible the appearance of gray mold or the fall of leaves or buds",
               "flowering": "It takes place from May to October",
               "origins": "Brasil"
               },
               {
               "commonName": "berberis",
               "img1": "berberis.jpg",
               "scientificName": "Berberis",
               "generalDescription": "The genus includes about four hundred species of tall shrubs from one to three meters with large brown roots outside and yellow internally; the plant is very branched with thorny branches. The leaves are elliptic, narrow at the base in a short petiole, are obtuse or rounded at the apex; the consistency is almost leathery, the surface is glabrous and glossy, the margin is notched. The leaves are alternate on the long branches or are gathered in bundles on very short branches, at the base of each of which there is a thorn composed of three-seven very pungent prickles. The flowers are grouped in number of 15-20 on pendulous racemes inserted to the axils of the twigs; they have six yellow sepals so close to the six petals that the flower appears as double. The fruit is a 1 cm long ellipsoidal berry, red in color and long persistent on the plant, which contains two or three seeds from the horny shell",
               "climate": "Temperate",
               "category": "Shrubby",
               "dedication": "Often",
               "exposure": "Full sun",
               "environment": "Indoor",
               "size": "Medium",
               "fertilization": "Fertilize in the spring with organic fertilizer",
               "irrigation": "Watering must be regular throughout the year and carried out twice a week",
               "pruning": "Depending on the type of cultivation and the species. It may be sufficient to eliminate the damaged parts or prune in case of excessive growth",
               "pruningDate": "",
               "repotting": "They are transplanted in spring, when necessary",
               "repottingDate": "",
               "propagation": "It is sown outdoors in November. The hybrids reproduce by cuttings taken from the side branches in August or September and placed to root in a mixture of sand and garden soil",
               "illnesses": "It is a resistant plant, but it can sometimes be attacked by aphids and badly white",
               "flowering": "Depending on the species occurs in spring and summer months",
               "origins": "Native of South America and tropical North Africa"
               },
               {
               "commonName": "camassia",
               "img1": "camassia.jpg",
               "scientificName": "Camassia",
               "generalDescription": "Flowery, bulbous, easy to grow herbaceous plant. The leaves are ribbon-like, the flowers have the shape of a star and are collected in terminal racemes. They are included in the genus 6 species of plants, the best known are: C. Leichtlinii, with purple or blue flowers and reaches 90 cm .; C. cusickii with purple flowers and greenish-blue ribbon leaves; C. quamash with blue flowers - violet, white, purple, 4 cm large, the racemes reach 15 - 20 cm. of length. They are species suitable for undergrowth, in fact, they can be placed in a semi-shaded area of the garden or terrace.",
               "climate": "Mediterranean",
               "category": "Bulbous",
               "dedication": "Rarely",
               "exposure": "Full sun",
               "environment": "Outdoor",
               "size": "Medium",
               "fertilization": "No special fertilizers are required. We can certainly give organic fertilizer.",
               "irrigation": "Depending on the place of cultivation, always very humid soil. If grown in too dry soils, they tend to turn yellow, then increase the watering.",
               "pruning": "It is sufficient to remove the damaged or faded parts",
               "pruningDate": "",
               "repotting": "No information about repotting",
               "repottingDate": "",
               "propagation": "By sowing in the box towards July. Beware of buying seeds or bulbs of the current year. Seedlings are obtained to be used in the autumn of the following year to carry out transplantation. Plants capable of flowering (1-2 years) are obtained more quickly using the bulbs that separate from the main bulb. With the use of seeds the waiting of the flowers is prolonged up to 3 years. For planting in flowerbeds or borders the correct distance for the plant varies from 15 to 25 cm. according to the species.",
               "illnesses": "No particular diseases or parasites are reported",
               "flowering": "Beginning of flowering, approximately towards mid-April",
               "origins": "North America"
               },
               {
               "commonName": "onion",
               "img1": "onion.jpg",
               "scientificName": "Allium cepa",
               "generalDescription": "Two-year-old bulbous herbaceous plant, the plant has leaves that in the lower part become enlarged giving rise to the edible pate. It has long floral stems, with an umbrella-shaped inflorescence.",
               "climate": "Temperate",
               "category": "Bulbous",
               "dedication": "Often",
               "exposure": "Full sun",
               "environment": "Outdoor",
               "size": "Medium",
              "fertilization": "Fertilize every few weeks with nitrogen to get big bulbs. Cease fertilizing when the onions push the soil away and the bulbing process has started. Do not put the soil back around the onions; the bulb needs to emerge above the soil.Generally, onion plants do not need consistent watering if mulch is used. About one inch of water per week (including rain water) is sufficient. If you want sweeter onions, water more. Onions will look healthy even if they are bone dry, be sure to water during drought conditions.Make sure soil is well-drained. Mulch will help retain moisture and stifle weeds.",
               "irrigation": "The onion is very sensitive to water stagnation",
               "pruning": "No information about pruning",
               "pruningDate": "",
               "repotting": "No information about repotting",
               "repottingDate": "",
               "propagation": "The cultivation technique of the different types of onions (pre-spring, summer, winter) is identical, only the sowing time changes. the onion is a renewal plant and should not be repeated.",
               "illnesses": "It can be struck by the onion fly, and the anger, awl and moth.",
               "flowering": "The flowers appear during the spring season and are yellowish-white in color",
               "origins": "America"
               },
               {
               "commonName": "potato",
               "img1": "potato.jpg",
               "scientificName": "Solanum tuberosum",
               "generalDescription": "Perennial herb plant with fleshy underground stems, tubers. It has a brown-green plane covered with hair, about 50 to 100 cm long, in an upright position in the initial phase of development and bent towards the growing soil. The leaves: they are a beautiful green color, imparipinnate, glabrous on the upper page and hairy in the lower one",
               "climate": "Wet temperate",
               "category": "Bulbous",
               "dedication": "Often",
               "exposure": "Full sun",
               "environment": "Outdoor",
               "size": "Small",
               "fertilization": "The fertilizations, mainly potassic, must be done when the plant has reached ten centimeters",
               "irrigation": "Water stagnations should be avoided",
               "pruning": "No information about pruning",
               "pruningDate": "",
               "repotting": "No information about repotting",
               "repottingDate": "",
               "propagation": "The multiplication occurs for tubers, which can be buried whole or divided into several pieces, each with at least two buds",
               "illnesses": "Among the parasites that attack the potato the most important are: the decemlineable Colorado beetle that is a beetle that feeds on the leaves of the plant both as larva and as an insect. Among the cryptogams we remember the peronospora and the badly white",
               "flowering": "The flowers, grouped in clusters, have green chalices formed by five joined sepals, and a white or rosy crown formed by five petals, partly concave to form a short tube that opens into a wide lobe",
               "origins": "Latin America"
               },
               {
               "commonName": "bougainvillea",
               "img1": "bougainvillea.jpg",
               "scientificName": "Bougainvillea",
               "generalDescription": "Climbing shrub that can be induced to fall; it has rather insignificant leaves and flowers when compared to the showy leaf bracts, which surround it and which can be red, pink, magenta, crimson, taupe, apricot or white. The branches are thorny and bear oval leaves that are not particularly decorative",
               "climate": "Mediterranean",
               "category": "Creeper",
               "dedication": "Assiduously",
               "exposure": "Full sun",
               "environment": "Outdoor",
               "size": "Medium",
               "fertilization": "Fertilizer for flowering plants according to the manufacturer's instructions",
               "irrigation": "In summer keep the soil always slightly damp and avoid stagnant water. For specimens grown in the ground it is necessary to intervene in particularly dry periods during the autumn winter, in summer to irrigate regularly.",
               "pruning": "In February it is advisable to prune the main branches to one third of their length and thin out the others. Also remove the weakest branches",
               "pruningDate": "",
               "repotting": "Every year, at the beginning of spring, in particular during the months of February and March",
               "repottingDate": "",
               "propagation": "By cutting. In summer, woody cuttings are taken with a length of about 7 cm that must be planted in pots of about 6 cm in diameter in a sandy compost. Subsequently, for a period of 3 weeks, the period of rooting, it is good to place them in special boxes in order to guarantee a temperature around 20-25 ° C. Alternatively 15 cm cuttings can be taken from more mature branches in January. The procedure to be followed to obtain rooting is the same as above; the temperature to be maintained, in this case, is about 18 ° C",
               "illnesses": "It may be subject to cochineal attacks",
               "flowering": "It is from June to the end of autumn",
               "origins": "Tropical and subtropical areas of South America"
               },
               {
               "commonName": "ivy",
               "img1": "ivy.jpg",
               "scientificName": "Hedera helix",
               "generalDescription": "Ubiquitous genus of very simple cultivation, the ivy can be grown indoors or outdoors. It is a typical evergreen climber, which, depending on the species and the variety, can grow from 4-5 m up to 30 m. From Edera Helix are derived many varieties that change a lot in the form (stellata, palmata, rhomboid). The leaves may have variegations on the margins and on the veins of the foliage of different colors: yellow, golden, white-cream or gray. The flowers are hermaphrodites, small in size and green-yellow in color, gathered in umbrella-like inflorescences; the fruits are black-bluish berries, toxic to humans. If we keep these plants in small pots they will remain small, on the contrary, if they are buried in the garden they can increase a lot.",
               "climate": "Temperate",
               "category": "Creeper",
               "dedication": "Rarely",
               "exposure": "Dim light",
               "environment": "Outdoor",
               "size": "Medium",
               "fertilization": "Fertilize in the spring every 20/30 days, using a complex fertilizer.",
               "irrigation": "Keep moist the soil, at least in summer",
               "pruning": "Only containment pruning in suitable shapes and volumes. Preferably practice it in spring. In optimal conditions, pruning can be repeated even 2-3 times in a year",
               "pruningDate": "",
               "repotting": "To be carried out in spring. Generally it does not require frequent reinvasation. The recommended maximum diameter should not exceed 30 cm., When this dimension is reached we can proceed by integrating it with superficial soil.",
               "repottingDate": "",
               "propagation": "It propagates very easily by nodal herbaceous cuttings, between June and October, with the method of the spread we can bury the shoots after having made an incision on the lower part.",
               "illnesses": "No particular diseases or parasites are reported. The slugs can feed on the leaves damaging them. To bait them, it is better to use the baits.",
               "flowering": "It blooms in summer; the flowers are worn on the flowering branches that are distinguished from the sterile ones because they have ovate and not typed leaves. These inflorescences possess little ornamental value.",
               "origins": "No information"
               },
               {
               "commonName": "string bean",
               "img1": "string bean.jpg",
               "scientificName": "Phaseolus vulgaris",
               "generalDescription": "Generally climbing plant, annual, with a fickle, bushy trunk, with ovate leaves and flowers in axillary clusters. Its fruits are pods that are still picked tender (for consumption so-called in salad), when they have not yet begun the formation of the wires are called green beans, cornetto beans or eaten. They begin to gather when the pod is still tender and, inside, the small seeds begin to appear; the legume must divide with a sharp fracture.",
               "climate": "Wet temperate",
               "category": "Creeper",
               "dedication": "Assiduously",
               "exposure": "Full sun",
               "environment": "Outdoor",
               "size": "Small",
               "fertilization": "Administer a fertilizer rich in phosphorus and potassium during growth.",
               "irrigation": "Water abundantly, without forming stagnant water, do not wet the leaves to avoid the occurrence of diseases.",
               "pruning": "No information about pruning",
               "pruningDate": "",
               "repotting": "No information about repotting",
               "repottingDate": "",
               "propagation": "No information about propagation",
               "illnesses": "To escape the attack of numerous parasites, it is useful to resort to the pregermination, taking for a few days the seeds in warm water and sowing as soon as you highlight the radicle, taking care that the soil that receives the seed, is well moist.",
               "flowering": "The flowers are in axillary bunches, generally yellow, intensely perfumed, each provided with two lateral bracts. The tubular chalice opens at the top in five segments, while the corolla has a typically papilionacea structure, composed of five pieces to form a superior banner, two wings on the sides and the hull, in the lower median part, formed by two petals fused in the terminal.",
               "origins": "America"
               },
               {
               "commonName": "american agave",
               "img1": "american agave.jpg",
               "scientificName": "Agave americana",
               "generalDescription": "Agave is a bushy plant, which has regular globose hair. It reaches varying heights from 2-3 up to 5-6 m. The stem is short and stocky, lignified, crowned. The long fleshy leaves are persistent, succulent, linear, elongated, long from 60-70 up to 150-200 cm and 20-30 cm wide (in the basal part) have pointed apex, sharp and pungent and the thorny margin. The flowers are yellow-greenish, perigonium tubular campanulate, gathered in panicle inflorescences placed at the center of the leaf rosettes, on long peduncles or erect stems, tall up to 6-8 m. The fruit is an oblong trivalve capsule. Some parts of the fabric of these plants are called parenchyma, thanks to these structures the plant can survive even in case of dry periods.",
               "climate": "Desert",
               "category": "Officinal",
               "dedication": "Rarely",
               "exposure": "Bright light",
               "environment": "Outdoor",
               "size": "Small",
               "fertilization": "During the vegetative period it is possible to provide a fertilizer for succulent plants every 20-30 days",
               "irrigation": "They are satisfied with the rains, and can endure long periods of drought without problems. If grown in pots need sporadic watering from March to October",
               "pruning": "It is necessary to remove the dry inflorescence",
               "pruningDate": "",
               "repotting": "The specimens in the container must be repotted every 3-4 years, taking care not to damage the roots in spring",
               "repottingDate": "",
               "propagation": "Through seeds that are buried in the spring, in seedbeds that must be kept humid and in a sunny place. In general, the agave propagate by removing the basal suckers, which root very easily",
               "illnesses": "It can be attacked by aphids and cochineal",
               "flowering": "Between spring and summer, in the months of May and June. Often, after the flowering, next to the flowers sprout of \"bulbilli\" (small seedlings already formed) that will fall on the ground and will give life to a new colony of Agavi",
               "origins": "Mexico"
               },
               {
               "commonName": "laurel",
               "img1": "laurel.jpg",
               "scientificName": "Laurus nobilis",
               "generalDescription": "Tall evergreen tree up to 6 meters. Plant with a very pleasant appearance and with a stem and pleasantly perfumed leaves. The stem is reddish-brown but with time becomes gray, the young branches are green and flashable. the leaves have a leathery consistency and are lanceolate, whole, up to 10 cm long, have a dark glossy green color on the upper page and opaque in the lower one. The flowers are dioecious and appear in small bundles at the axil of the leaves. The male flowers are small and yellowish, the female ones are white. The fruit is a shiny and black fleshy drupe that contains a seed.",
               "climate": "Temperate",
               "category": "Officinal",
               "dedication": "Rarely",
               "exposure": "Average light",
               "environment": "Outdoor",
               "size": "Medium",
               "fertilization": "It does not need particular fertilizations, however, of the well mature manure to enrich the soil can be appreciated",
               "irrigation": "Watering for young plants, necessary if grown in pots, in this case, however, wait for the soil to dry between interventions. It is generally very resistant to drought, especially if it is adult eseplars in the ground.",
               "pruning": "eliminate damaged or dry branches",
               "pruningDate": "",
               "repotting": "If grown in pots, the laurel seedlings must be repotted every two years because even if they are plants that do not grow very quickly, the roots take up a lot of space.\n\nRepotting is done in the spring using a good fertile soil that remains soft because the plants do not like water stagnations so both the pot and the earth must ensure good drainage.",
               "repottingDate": "",
               "propagation": "It takes place by cuttings at the end of summer. The cuttings must be buried in a peat and sand substate. In August you can also use the offshoot, using long low branches, engraved on the lower part.",
               "illnesses": "You can check the presence of cochineals, which can be eliminated simply with specific medicines. The damage of these pests are direct, but also indirect, on the honeydew that produce, in fact, you can create some fagots.",
               "flowering": "It blooms during the spring",
               "origins": "Europe, Asia Minor"
               },
               {
               "commonName": "geranium",
               "img1": "geranium.jpg",
               "scientificName": "Geranium",
               "generalDescription": "Herbaceous plant belonging to the genus of aromatic geraniums. It does not have any flowery blooms like those of other geraniums, but the beautiful leaves, also variegated and delicately scented with rose make it very pleasant. The flowers are simple, small and pink.",
               "climate": "Temperate",
               "category": "Officinal",
               "dedication": "Often",
               "exposure": "Full sun",
               "environment": "Outdoor",
               "size": "Small",
               "fertilization": "It is advisable to start with a soil only slightly fertilized and then follow the growth of the plant by increasing the fertilizations. The fertilization is stopped before the start of flowering. During cultivation, balanced N: P: K fertilizers are used, from February onwards, fertilizers with higher P and K are used.",
               "irrigation": "After the potting the water absorption of the different varieties or even of individual plants can be very different; therefore in the first 15 days, irrigation must be carried out with great care, avoiding to wet the already wet plants. During the bottling phase at low temperatures, irrigation should be performed without wetting the vegetation to avoid the onset of Botrytis. In spring, as the brightness increases, irrigations increase to avoid drought stress",
               "pruning": "It is good to remove the faded inflorescences both for questions of phytosanity and to stimulate a greater emission of flowers. Before going to rest you can practice a reduction pruning",
               "pruningDate": "",
               "repotting": "At the end of spring, towards the end of April or beginning of May, strongly pruning the plant and replacing the soil",
               "repottingDate": "",
               "propagation": "The multiplication occurs both by seed and by cutting: the first method allows you to have new hybrids, while to preserve the characteristics of the mother plant we resort exclusively to the cutting",
               "illnesses": "They can be subject to various rot or fungi due to excessive humidity",
               "flowering": "It begins to bloom around March until around the end of October",
               "origins": "Africa"
               },
               {
               "commonName": "adenium",
               "img1": "adenium.jpg",
               "scientificName": "Adenium",
               "generalDescription": "Tropical, dicotyledonous, caudic, shrub-like plants with a strongly succulent trunk, which can reach a height of 2.5-3 meters, with oval, coriaceous leaves of a bright green color, simple, sometimes alternate, and with veins parallel on the lower base. The flowers, pink or white, with the outer margins darker and hermaphroditic, have five petals and five sepals; appear on the new branches and reach a diameter of 13 cm. The flowers are followed by bilobed green fruits which are sometimes in the shape of a berry or drupe. The seeds are supplied with egg white, with wings or with hairs.",
               "climate": "Tropical",
               "category": "Herbaceous",
               "dedication": "Assiduously",
               "exposure": "Average light",
               "environment": "Outdoor",
               "size": "Small",
               "fertilization": "Ternary fertilizer to be used approximately once a month according to the manufacturer's instructions",
               "irrigation": "From October to May it must be watered once every two weeks; in the remaining months whenever the ground is dry. Plants placed in a small pot, however, need more frequent waterings",
               "pruning": "It is enough to cut the dried branches and the withered flowers",
               "pruningDate": "",
               "repotting": "Every two years always in spring",
               "repottingDate": "",
               "propagation": "It is carried out by seed in the same compound of wet cultivation, placing the vase under a glass bell. Being a very slow growing plant, it will bloom after about three to four years",
               "illnesses": "He is very afraid of the cold, as it can make it rot. It can be attacked by the brown cochineal",
               "flowering": "Summer",
               "origins": "East Africa"
               },
               {
               "commonName": "cedronella",
               "img1": "cedronella.jpg",
               "scientificName": "Cedronella canariensis",
               "generalDescription": "Herbaceous, aromatic, semirustica plant, which reaches a height of one meter. It has bilabial, pink or light mauve flowers, which in summer are followed by black capsules. The leaves are three-lobed and toothed, with a strong scent of eucalyptus.",
               "climate": "Temperate",
               "category": "Herbaceous",
               "dedication": "Often",
               "exposure": "Full sun",
               "environment": "Outdoor",
               "size": "Medium",
               "fertilization": "Fertilize with a high nitrogen plant food once each month to keep the leaves green.",
               "irrigation": "Water your citronella geranium well after you plant it and keep the soil moist but not soggy.",
               "pruning": "Pinch off any leaves that turn yellow—this is a normal occurrence. You can also prune any spent flowers or rambling branches to keep it looking attractive.",
               "pruningDate": "",
               "repotting": "Transplant your young citronella geranium to a larger pot or into your garden. If you’re repotting it, use a good potting soil that will provide good drainage. If you’ll be planting it in the ground, choose an area with good drainage that receives full sun 6 to 8 hours each day. This plant also thrives where air circulation around it is good.",
               "repottingDate": "",
               "propagation": "At the beginning of the summer, collect the cuttings and when they are rooted, take them out and make them in a cold and then plant them in the spring.",
               "illnesses": "No information about illnesses",
               "flowering": "The plant blooms during the summer season.",
               "origins": "Canary Islands"
               },
               {
               "commonName": "sofora",
               "img1": "sofora.jpg",
               "scientificName": "sophora Japonica",
               "generalDescription": "Deciduous tree of medium size, with dark and smooth bark, composed leaves imparipinnate forming a very characteristic roundish foliage, with rather twisted branches. The inflorescence is a whitish bunch, the fruits are elongated and fleshy legumes that contain blackish ovoid seeds when ripe.\nIts flowers have a pleasant scent.",
               "climate": "Temperate",
               "category": "Herbaceous",
               "dedication": "Rarely",
               "exposure": "Full sun",
               "environment": "Outdoor",
               "size": "Big",
               "fertilization": "Use well mature manure.",
               "irrigation": "Intervene in case of young specimens or particularly dry periods. In general, it tolerates drought very well, as it does not have many water requirements.",
               "pruning": "Japanese pagoda trees are pruned during the dormant season, in late winter. A fall-blooming tree, the flower buds develop over the summer, so pruning in winter has no effect on the blossoms. Structural pruning, removing larger branches and training the tree to one main trunk are among the pruning chores conducted when the tree is dormant. As the tree matures, the lowest branches are usually removed before they reach 2 inches in diameter, allowing you to walk or drive under the tree.",
               "pruningDate": "",
               "repotting": "No information about repotting",
               "repottingDate": "",
               "propagation": "It is sown in spring in the greenhouse, when the seedlings are handled it is invaded in small pots. The young specimens are grown in nurseries up to about 3 years.",
               "illnesses": "Sophora species is generally pest- and disease- free. Occasionally, Scholar Tree will get a fungus canker about two-inches or less across, have raised reddish brown margins and light brown centers. The infected stem is killed when the fungus girdles the stem. Another fungus is sometimes found on dead branches on Sophora species. Frost injury may give both fungi an entrance into the tree. Prune out dead, damaged, or diseased branches.",
               "flowering": "Flowering is ornamental and occurs in spring.",
               "origins": "China, Korea, Japan"
               },
               {
               "commonName": "blueberry",
               "img1": "blueberry.jpg",
               "scientificName": "Vaccinium uliginosum",
               "generalDescription": "Spontaneous in Europe, 15-25 cm tall, deciduous. The leaves are small, oval, glossy, green, pale on the lower page",
               "climate": "Temperate",
               "category": "Bushy",
               "dedication": "Often",
               "exposure": "Full sun",
               "environment": "Outdoor",
               "size": "Medium",
               "fertilization": "Nitrogen must not be given in excess: especially in soils rich in organic matter, annual contributions of 30-50 Kg / ha of nitrogen are optimal. Better acid based formulations (\"sulfates\") for all the elements.",
               "irrigation": "The water, not calcareous, must always flow in a short time even in the event of heavy rainfall",
               "pruning": "Eliminate the sick and dry parts",
               "pruningDate": "",
               "repotting": "Choose a container that is a few inches larger than the one the blueberry shrub is planted in. A good container is a pot 16 to 20 inches wide, or a half-barrel. The best time to repot the blueberries is in the early spring before its annual growth begins.Mix equal parts of peat moss and shredded pine bark to create an acidic soilless mixture. Another option is to use commercially available rhododendron or azalea soil mixture, which also meets the acid soil requirements of blueberry plants. The best soil pH is 5.0 to 5.5. Fill the new container halfway full with the soilless mix.Remove the blueberry bush from its current container and shake the soil from the roots. Examine the roots for dead or rotted areas. Prune these away with pruning shears. Place the bush in the new container and add or remove soil from under the root ball to raise the top of the root ball 2 inches below the rim.Pack the soil around the root ball and fill the container until the soilless mix is 2 inches below the top of the root ball. Pour water into the container until it runs out the bottom.Fill the top 4 inches of the container with a mulch, such shredded pine bark or pine needles. This provides the blueberry shrub adds acidity to the soil and conserves moisture.",
               "repottingDate": "",
               "propagation": "It is propagated by woody or herbaceous cutting",
               "illnesses": "It is not subject to particularly relevant parasitic attacks",
               "flowering": "White-red flowers",
               "origins": "Europe and North America"
               },
               {
               "commonName": "euphorbia trigona",
               "img1": "euphorbia.jpg",
               "scientificName": "Euphorbia trigona",
               "generalDescription": "Of this kind are part of many species with characteristics and needs also very dissimilar between them; they are about 2000 and come from different parts of the world. In general, all species are simple to grow. The variety is multiform, some of them even look like cactaceae, from which they stand out thanks to the flowers gathered in cyan and for the production of a whitish and toxic latex that is present inside the plants. Many varieties also have real leaves, which give the plant a more bushy bearing than a cactacea. All species belonging to this genus produce unisexual flowers. The fruits have a snap opening system to project the seeds at a good distance from the mother and are called tricocchi.",
               "climate": "Tropical",
               "category": "Bushy",
               "dedication": "Rarely",
               "exposure": "Bright light",
               "environment": "Outdoor",
               "size": "Small",
               "fertilization": "It is suggested to fertilize in the summer period once a month with fertilizer for succulents.",
               "irrigation": "Keep the soil rather dry; water only during the summer period, regularly but letting the soil dry between one watering and another.",
               "pruning": "No pruning is performed. We can clean the plant from dust using a small brush gently.",
               "pruningDate": "",
               "repotting": "In spring, when necessary.",
               "repottingDate": "",
               "propagation": "For cuttings that must be placed in a sandy substratum between the beginning of spring and August. When they are rooting, they must keep the soil moist and protect them from direct sunlight.",
               "illnesses": "It can be subject to radical rot due to excess moisture, aphids and mealy cochineals.",
               "flowering": "It starts to bloom around August, until late October.",
               "origins": "fringe south western, tropical; Madagascar."
               },
               {
               "commonName": "dill",
               "img1": "dill.jpg",
               "scientificName": "anethum",
               "generalDescription": "Dill grows up to 40–60 cm (16–24 in), with slender hollow stems and alternate, finely divided, softly delicate leaves 10–20 cm (4–8 in) long. The ultimate leaf divisions are 1–2 mm (0.04–0.08 in) broad, slightly broader than the similar leaves of fennel, which are threadlike, less than 1 mm (0.04 in) broad, but harder in texture. The flowers are white to yellow, in small umbels 2–9 cm (0.8–3.5 in) diameter. The seeds are 4–5 mm (0.16–0.20 in) long and 1 mm (0.04 in) thick, and straight to slightly curved with a longitudinally ridged surface.",
               "climate": "Temperate",
               "category": "Bushy",
               "dedication": "Rarely",
               "exposure": "Full sun",
               "environment": "Outdoor",
               "size": "Big",
               "fertilization": "Use well mature manure",
               "irrigation": "Intervene in case of drought periods, or when the heat is more intense.",
               "pruning": "No information about pruning",
               "pruningDate": "",
               "repotting": "No information about repotting",
               "repottingDate": "",
               "propagation": "The seeds are harvested when they start to turn dark.",
               "illnesses": "Insects are often the vectors for disease and aphids are one of the major culprits. Aphid infestations may result in the dill acquiring Carrot Motley Dwarf disease. This disease is caused by two viruses, carrot redleaf virus and carrot mottle virus, both of which must be present to infect the plant. The disease causes yellow and red discoloration of leaves and general stunting of plant growth. As the name suggests, carrots have are the origin for this disease, the aphids just pass it along. To prevent this disease of dill, control aphids with insecticidal soap and avoid planting the herb near areas of the garden where carrots have overwintered.",
               "flowering": "The plant blooms during the spring",
               "origins": "Southern Europe and the East, Southwest Asia."
               },
               {
               "commonName": "lemon",
               "img1": "lemon.jpg",
               "scientificName": "Citrus acida",
               "generalDescription": "Vigorous evergreen plant with bright green foliage, outdoors, but also cultivable in pots. The fruits are medium-sized. It is characterized by oval leaves, fragrant white flowers, very juicy and fragrant yellow fruits with wrinkled peel rich in essential oils",
               "climate": "Temperate",
               "category": "Fruit Plant",
               "dedication": "Often",
               "exposure": "Full sun",
               "environment": "Outdoor",
               "size": "Medium",
               "fertilization": "No particular fertilizer is required. Provide occasionally a specific liquid fertilizer for citrus fruits",
               "irrigation": "The waterings must be such that between one and the other the soil arrives to dry on the surface. In winter a little rarer. Excessive drought is detrimental to fruit production and can cause it to fall off",
               "pruning": "It is done in summer, so do not prune before mid-July. With the pruning the form must be given to the plant and the new branches should be renewed, which should have a fairly broad and intricate bearing, in order to favor, besides an easy harvest of the fruits, the free circulation of the air between the leaves and the regular insolation of all branches",
               "pruningDate": "",
               "repotting": "Depending on the type of cultivation, rather rarely. When the plant is too big and it is no longer possible to replace the vase, it must be re-bored, ie it must be replaced by the earth.",
               "repottingDate": "",
               "propagation": "For seed that germinates quite quickly. The sowing is done in March in small pots with peat soil and 1/3 of sand, holding them a couple of cm. below the surface. Moderately warm and bright ambient conditions. Keep the ground always a bit 'wet, but not too wet. Water daily using a sprayer to keep the soil from moving and do not disturb the seed. ",
               "illnesses": "No particular diseases or parasites are reported",
               "flowering": "It can bloom again at any time of the year with very fragrant flowers. To stimulate flowering the lemon must have a period of low temperatures (about 10 ° C) for about 1 month. For this reason it is good not to store the plant too early",
               "origins": "ud-east asian"
               },
               {
               "commonName": "orange",
               "img1": "arancio.jpg",
               "scientificName": "Citrus sinensis",
               "generalDescription": "Fruit tree with compact foliage that can reach 12 meters in height. Presents elongated and fleshy leaves with white flowers. The fruits are roundish and the characteristic orange color whose pulp can be blond or red depending on the anthocyanic pigments contained therein.",
               "climate": "Wet temperate",
               "category": "Fruit Plant",
               "dedication": "Often",
               "exposure": "Full sun",
               "environment": "Outdoor",
               "size": "Medium",
               "fertilization": "Fertilize with mature manure.",
               "irrigation": "The plant also supports drought epriodi but for a better production of flowers and therefore of fruits it is necessary to guarantee regular irrigations from spring to autumn. Avoid excesses and always wait for the soil to dry between one watering and another.",
               "pruning": "intervene only in adulthood following the appropriate rules for citrus fruits. Avoid the months of February and March when the plant contains many nutrients.",
               "pruningDate": "",
               "repotting": "In the first phase of his life he can also be cultivated in pots.",
               "repottingDate": "",
               "propagation": "Multiplication occurs by cuttings or by grafting",
               "illnesses": "Trees affected by sooty mold have blackened spots on the leaves. Sooty mold is not really a disease, but a fungus that feeds on the honeydew left behind by aphids and leafhoppers. Wash the spots off with a gentle soap and water solution. In most cases, aphids and leafhoppers leave on their own, especially if your garden has plenty of predatory insects like ladybugs. In severe infestations, though, you can try spraying the leaves with a steady stream of water or with an insecticidal soap or oil. Completely treating an orange tree is difficult, though.",
               "flowering": "The flowers appear in spring and are white, axillary and very fragrant.",
               "origins": "China"
               },
               {
               "commonName": "cherry tree",
               "img1": "ciliegio.jpg",
               "scientificName": "Prunus aviu",
               "generalDescription": "Small tree with an upright habit and an ovate foliage, bright green. The trunk is erect, soon branched and with brownish-red bark and with characteristic horizontal cracks. This plant can also be 15-20 m tall with foliage that can reach 8-10 m.",
               "climate": "Temperate",
               "category": "Fruit Plant",
               "dedication": "Rarely",
               "exposure": "Full sun",
               "environment": "Outdoor",
               "size": "Big",
               "fertilization": "Prefer organic fertilizers such as manure or manure. Avoid fertilization during dry periods",
               "irrigation": "Irrigation is absent but it must be ensured that drainage is necessary to eliminate stagnation",
               "pruning": "Eliminate the dry parts and perform light cuts of return, it does not bear the pruning due to the strong emission of resin",
               "pruningDate": "",
               "repotting": "No information about repotting",
               "repottingDate": "",
               "propagation": "The rootstock most used by nurserymen is the franc, which gives a remarkable development to the plant and enters production after 6-8 years. The franc prefers loose, very deep and draining soils.",
              "illnesses": "Root and crown rot diseases result from a fungus-like organism that is present in most soils. It only infects the tree if the moisture level of the soil is very high, like when the tree grows in standing water. Symptoms of rot diseases include slowed growth, discolored leaves that wilt quickly in hot weather, dieback and sudden plant death. This is one of the worst cherry tree diseases. Once a cherry tree has a rot disease, there is no cure. However, rot diseases of cherry trees can generally be prevented by making sure the soil drains well and regulating irrigation.",
               "flowering": "Very ornamental flowering with white flowers gathered in umbrellas of 6-10 elements. They bloom in March-April, before or together with the young leaves",
               "origins": "Asia"
               },
               {
               "commonName": "tree of happiness",
               "img1": "happiness.jpg",
               "scientificName": "Dracaena",
               "generalDescription": "It has green lanceolate leaves, very coriaceous, with a growth of tufts, which give the plant the shape and bearing of a palm. They grow on shoots placed directly on the stem, which, in the adult plant, is woody, similar to a trunk from which the name attributed to them. The flowers possess a perigonium of 6 tepals arranged in 2 trimeri verticilli, an androceo of as many stamens and a supersized ovary formed by 3 welded carpels. Blooming is abundant, but the flowers are not very visible, and they are quite insignificant. Numerous berries are produced after flowering",
               "climate": "Tropical",
               "category": "Erected",
               "dedication": "Assiduously",
               "exposure": "Bright light",
               "environment": "Outdoor",
               "size": "Medium",
               "fertilization": "It is advisable to use ternary fertilizers, with the addition of iron to obtain a healthy and shiny foliage. During the spring and summer, fertilize twice a month. Suspend fertilization during the winter period",
               "irrigation": "During the spring and summer they must be abundantly watered, taking care to periodically spray the leaves. In the winter period the waterings will have to be reduced a lot. In any case it is inadvisable to leave water in the saucer: these plants, in fact, do not tolerate water stagnation",
               "pruning": "Usually you do not pruned the logs, just keep clean",
               "pruningDate": "",
               "repotting": "When necessary, in spring, in a vase a few centimeters larger than the previous one",
               "repottingDate": "",
               "propagation": "Mainly by apical cuttings which are easily obtained from the seedlings that sprout at the base of the mother plant",
               "illnesses": "The parasites that attack these plants more frequently are the cochineals, which form round, white and gray scales on the leaves and stems. To cure the cochineal, the plant should be abundantly sprayed with white oil mixed with a specific pesticide. As for diseases, the dracena suffer a lot of root rot that attacks the trunk making it soggy. The aerial apparatus may also be affected (irregular yellow-brown spots form and, on the underside of the leaf, small rust-colored dots are created). Use a specific fungicide",
               "flowering": "May and June",
               "origins": "Central America and West Indies"
               },
               {
               "commonName": "coffee",
               "img1": "caffe.jpg",
               "scientificName": "Coffea arabica",
               "generalDescription": "Shrub or small evergreen tree. In its natural habitat it reaches 8 meters, in pot, however, its growth is between 1 and 2 m. It is a leafy-looking shrub, with shiny leaves, leathery, very dark green, oval, elongated and wavy at the edges, with short petiole. In optimal environmental conditions it can also flourish at home; the flowers are white, stellar, pleasantly perfumed, bloom gathered in clusters at the axils of the leaves. ",
               "climate": "Tropical",
               "category": "Erected",
               "dedication": "Assiduously",
               "exposure": "Bright light",
               "environment": "Outdoor",
               "size": "Medium",
               "fertilization": "It is good to add a universal fertilizer to the water of watering every two weeks in spring and summer, while in autumn and winter it is added only once a month. When the plant is adult this trick will favor the appearance of flowers in summer.",
               "irrigation": "From March to October it is advisable to provide the plant with abundant quantities of water, without soaking the soil; if you want you can also spray the leaves in the hottest periods, in order to guarantee a humid climate; in the colder months the amount of water administered must be reduced by adjusting with the decrease in temperature.",
               "pruning": "Remove the dried or damaged leaves",
               "pruningDate": "",
               "repotting": "Being a plant that can grow a lot it is better to assure a vase of the right size, and to support its growth by changing the container every year, keeping the same soil, possibly at the beginning of spring, before the vegetative restart.",
               "repottingDate": "",
               "propagation": "It takes place for sowing, at the beginning of spring, in containers filled with a mixture of peat and sand; they must be kept moist, in a sheltered place and at a temperature around 28 ° C. When germination occurs, the lighting must be increased and the temperature and humidity level reduced. When the seedlings are handled, and it's been at least a year, they move in pots. ",
               "illnesses": "Coffee is a plant that resists well to most diseases. Sometimes it can be attacked by cochineal and aphids, but it does not happen very often. Burns in the leaves can be caused by direct sunlight too intense. Excess or water shortages can cause rot or de-activation. Sometimes the ferric chlorosis is manifested that is fought with products based on iron chelates.",
               "flowering": "The period for flowering is the summer months.",
               "origins": "Africa. Originally it came from the Ethiopian highlands. Over time, commercial needs have spread its cultivation in most of the tropical areas, from South America to India."
               },
               {
               "commonName": "basil",
               "img1": "basil.jpg",
               "scientificName": "Ocimum basilicum",
               "generalDescription": "Erect herbaceous plant, which reaches a height of 30-60 cm, with opposite leaves, of a deep green color on the upper side and green-gray on the lower side. The flowers are small, white. The young leaves are the most fragrant",
               "climate": "Temperate",
               "category": "Erected",
               "dedication": "Often",
               "exposure": "Full sun",
               "environment": "Outdoor",
               "size": "Medium",
               "fertilization": "Use complex ternary fertilizer",
               "irrigation": "It must be abundantly watered, especially during the summer",
               "pruning": "Before flowering remove the apical buds to keep strong the aroma",
               "pruningDate": "",
              "repotting": "Basil needs to be in a location that gets 6 to 8 hours of full Sun daily; soil should be moist and well-drained. Plant seeds/seedlings about ¼-inch deep and 10 to 12 inches apart. They should grow to about 12 to 24 inches in height. For smaller plants, plant farther apart (about 16 to 24 inches).During the dry periods in summer, water the plants freely.Remember to pinch out the flower heads as soon as they appear to make sure that the leaves will continue growing.",
               "repottingDate": "",
               "propagation": "By seed. Sowing can be carried out directly in the pot or in the vegetable garden, taking care to protect the seeding area with non-woven fabric, when the temperature is not stable",
               "illnesses": "This basil disease is caused by a bacteria called Pseudomonas cichorii. Symptoms of bacterial leaf spot are black or brown spots that appear on the leaves and streaking on the stems of the plant. Bacterial leaf spot occurs when infected soil is splashed onto the leaves of the basil plant. While there is no fix for bacterial leaf spot, you can minimize the damage by making sure that your basil plants have plenty of air circulation and that they are watered in a way so that the bacteria is not splashed onto the leaves.",
               "flowering": "Spring",
               "origins": "India and Indonesia"
               },
               {
               "commonName": "rosemary",
               "img1": "rosemary.jpg",
               "scientificName": "Rosmarinus officinalis",
               "generalDescription": "Aromatic shrub from 50 cm to 2 m tall, with small leaves, lanceolate and very fragrant, dark green on the upper page and silver on the lower one. The flowers bloom in axillary groups, at different times of the year depending on the climate. They hold a bilabied chalice with a full upper lip and three small teeth and a lower lip divided into two long teeth; the color is bluish-violet. It is a very fragrant aromatic plant often used in the kitchen.",
               "climate": "Mediterranean",
               "category": "Shrubby",
               "dedication": "Rarely",
               "exposure": "Dim light",
               "environment": "Outdoor",
               "size": "Medium",
               "fertilization": "Use slow release organic fertilizer every two weeks from March to June, avoiding the time of flowering. Mature manure is always very suitable for fertilization.",
               "irrigation": "It needs regular watering only in case of severe drought",
               "pruning": "Eliminate dry or damaged branches. It is a rustic plant that adapts very well to pruning, in fact, it is possible to grow it to create hedges of the desired shape.",
               "pruningDate": "",
               "repotting": "Repot when necessary, in spring, always choosing a vase with a diameter only slightly wider than the previous one.",
               "repottingDate": "",
               "propagation": "It occurs by seed or by cuttings. Rooting cuttings in peat and sand is quite simple. You can quickly transplant in single pots.",
              "illnesses": "Blight Infection. This is both a fungal and bacterial infection which kills the plant tissues. Blight is encouraged where there is high humidity, bad air circulation and cloudy weather. Yellowish-brown spots and patches will appear on leaves and stems. These spread rapidly, resulting in wilting of foliage. Blight also results in water-soaked spots forming on the herb stems. Prune the herbs to prevent them from getting too bushy. ",
               "flowering": "The flowers bloom from March to October and are blue-white in color",
               "origins": "Mediterranean regions"
               }
              ]
              ,
    "list": [{
             "listName": "Garden",
             },
             {
             "listName": "Wishlist",
             }
             ]
}

